---
author: YLP
title: üñ•Ô∏è FICHE TP
---

## üñ•Ô∏è TP GUID√â CISCO PACKET TRACER
### "Configuration de Base d'un Switch SW_BUREAU_01"

---

### Objectif

Cr√©er une topologie simple, acc√©der √† la CLI d'un switch, le configurer enti√®rement (hostname, banner, passwords, save) et v√©rifier la configuration.

---

### Topologie √† R√©aliser

```
PC-Alice (192.168.10.10/24)‚îÄFa0/1‚îÄ‚îê
                                  ‚îÇ
PC-Bob   (192.168.10.20/24)‚îÄFa0/2‚îÄ‚î§  [SW_BUREAU_01]
                                  ‚îÇ
PC-Clara (192.168.10.30/24)‚îÄFa0/3‚îÄ‚îò
```

---

### √âtape 1 : Cr√©er la Topologie (5 min)

1. Ouvrir **Packet Tracer** ‚Üí Nouveau fichier
2. Ajouter :
   - 1 **Switch Cisco 2960** (dans Network Devices ‚Üí Switches)
   - 3 **PC** (dans End Devices)
3. C√¢bler : PC-Alice ‚Üí Fa0/1, PC-Bob ‚Üí Fa0/2, PC-Clara ‚Üí Fa0/3 (c√¢bles droits)
4. Configurer les IP des PC (onglet Desktop ‚Üí IP Configuration) :
   - PC-Alice : `192.168.10.10` / `255.255.255.0`
   - PC-Bob : `192.168.10.20` / `255.255.255.0`
   - PC-Clara : `192.168.10.30` / `255.255.255.0`

‚úÖ **Validation :** Les voyants des ports passent au vert (apr√®s quelques secondes).

---

### √âtape 2 : Acc√©der √† la CLI du Switch (2 min)

1. **Clic sur SW_BUREAU_01**
2. Onglet **CLI**
3. Appuyer sur **Entr√©e**
4. Si demande "Initial configuration dialog?" ‚Üí taper **`no`** puis Entr√©e

```
Would you like to enter the initial configuration dialog? [yes/no]: no
Press RETURN to get started!
Switch>
```

‚úÖ **Vous √™tes en mode User EXEC (prompt `Switch>`)**

---

### √âtape 3 : Explorer les Modes (5 min)

```cisco
Switch> ?                        ! Afficher les commandes disponibles en User EXEC

Switch> show version             ! Afficher les informations syst√®me

Switch> enable                   ! Passer en mode Privileged EXEC
Switch# ?                        ! Plus de commandes disponibles

Switch# show running-config      ! Afficher la config actuelle (vide pour l'instant)

Switch# configure terminal       ! Passer en mode Global Config
Switch(config)# ?                ! Commandes de configuration

Switch(config)# exit             ! Revenir en Privileged EXEC
Switch#
```

üìù **√Ä noter :** Quelles nouvelles commandes apparaissent en mode Privileged par rapport √† User ?

---

### √âtape 4 : Configurer le Hostname (3 min)

```cisco
Switch# configure terminal
Switch(config)# hostname SW_BUREAU_01
SW_BUREAU_01(config)#            ! Le prompt a chang√© !
```

‚úÖ **Validation :** Le prompt affiche maintenant `SW_BUREAU_01`.

---

### √âtape 5 : D√©sactiver la R√©solution DNS (1 min)

```cisco
SW_BUREAU_01(config)# no ip domain-lookup
```

üí° **Pourquoi ?** Sans cette commande, si vous faites une faute de frappe, Cisco essaie de r√©soudre le mot comme un nom DNS ‚Üí attente de 30 secondes √† chaque erreur !

---

### √âtape 6 : Configurer le Banner MOTD (5 min)

```cisco
SW_BUREAU_01(config)# banner motd #
Entrez votre message. Terminez avec le caract√®re '#'.

=========================================
 ACC√àS R√âSERV√â AU PERSONNEL AUTORIS√â
 Cabinet TechPro SARL - Service Informatique
 Toute connexion non autoris√©e est ill√©gale.
 Contact DSI : +33 01 23 45 67 89
=========================================
#
SW_BUREAU_01(config)#
```

‚úÖ **Validation :** Taper `end` puis `exit` pour se d√©connecter, puis reconnecter ‚Üí Le banner appara√Æt.

---

### √âtape 7 : S√©curiser le Mode Privil√©gi√© (2 min)

```cisco
SW_BUREAU_01(config)# enable secret Cisco@2024
```

‚úÖ **Validation :**
- Taper `end` pour revenir en Privileged
- Taper `disable` pour revenir en User EXEC
- Taper `enable` ‚Üí le mot de passe est maintenant demand√© !

```
SW_BUREAU_01> enable
Password: [taper Cisco@2024 - ne s'affiche pas]
SW_BUREAU_01#
```

---

### √âtape 8 : S√©curiser la Ligne Console (5 min)

```cisco
SW_BUREAU_01# configure terminal
SW_BUREAU_01(config)# line console 0
SW_BUREAU_01(config-line)# password Console@2024
SW_BUREAU_01(config-line)# login
SW_BUREAU_01(config-line)# exec-timeout 5 0
SW_BUREAU_01(config-line)# exit
```

---

### √âtape 9 : S√©curiser les Lignes VTY (5 min)

```cisco
SW_BUREAU_01(config)# line vty 0 15
SW_BUREAU_01(config-line)# password Vty@2024
SW_BUREAU_01(config-line)# login
SW_BUREAU_01(config-line)# exec-timeout 5 0
SW_BUREAU_01(config-line)# exit
```

---

### √âtape 10 : Chiffrer Tous les Mots de Passe (2 min)

```cisco
SW_BUREAU_01(config)# service password-encryption
SW_BUREAU_01(config)# end
```

---

### √âtape 11 : V√©rification Compl√®te (10 min)

```cisco
SW_BUREAU_01# show running-config
```

**V√©rifier ligne par ligne :**

| **Ce qu'on doit voir** | **Trouv√© ? ‚úÖ/‚ùå** |
|------------------------|-------------------|
| `hostname SW_BUREAU_01` | |
| `no ip domain-lookup` | |
| Message du banner (entre `^C`) | |
| `enable secret 5 $1$...` (hash MD5) | |
| `line con 0` avec `password 7 ...` et `login` | |
| `line vty 0 4` avec `password 7 ...` et `login` | |
| `exec-timeout 5 0` sur con et vty | |

---

### √âtape 12 : Observer la Table MAC (5 min)

```cisco
SW_BUREAU_01# show mac address-table
```

üìù La table est peut-√™tre vide. Pour la remplir :

1. Aller sur **PC-Alice** ‚Üí Desktop ‚Üí Command Prompt
2. Taper : `ping 192.168.10.20` (vers PC-Bob)
3. Revenir sur le switch, retaper : `show mac address-table`

**R√©sultat attendu :**
```
          Mac Address Table
-------------------------------------------
Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0001.xxxx.xxxx    DYNAMIC     Fa0/1
   1    0002.xxxx.xxxx    DYNAMIC     Fa0/2
Total Mac Addresses for this criterion: 2
```

üìù **Questions :**
- Combien d'entr√©es ? Pourquoi pas PC-Clara ?
- Quel type (DYNAMIC/STATIC) ?
- Apr√®s quel d√©lai les entr√©es dispara√Ætront-elles ?

---

### √âtape 13 : SAUVEGARDER ! (2 min)

```cisco
SW_BUREAU_01# copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```

**V√©rification :**
```cisco
SW_BUREAU_01# show startup-config
```
‚Üí La configuration doit √™tre identique √† `show running-config`.

---

### √âtape 14 : Sauvegarde du Fichier Packet Tracer

1. Menu **File** ‚Üí **Save As**
2. Nom : `NOM_Prenom_S6_TP_Switch_Config.pkt`
3. Sauvegarder dans votre dossier de travail.

---


