---
author: YLP
title: ðŸ–¥ï¸ FICHE TP
---

## ðŸ–¥ï¸ TP GUIDÃ‰ CISCO PACKET TRACER
### "3 VLANs, ports Access, Trunk inter-switches"

---

### Objectif

Configurer 3 VLANs sur 2 switches, affecter des ports Access, et crÃ©er un trunk inter-switches permettant aux machines du mÃªme VLAN de communiquer d'un switch Ã  l'autre.

---

### Topologie

```
RÃ©seau :
VLAN 10 (DIRECTION)     : 192.168.10.0/24
VLAN 20 (COMMERCIAL)    : 192.168.20.0/24
VLAN 30 (INFORMATIQUE)  : 192.168.30.0/24

SW-A (Switch A)                    SW-B (Switch B)
â”œâ”€ Fa0/1 : PC-Dir-A  (192.168.10.11)    â”œâ”€ Fa0/1 : PC-Dir-B  (192.168.10.21)
â”œâ”€ Fa0/2 : PC-Com-A  (192.168.20.11)    â”œâ”€ Fa0/2 : PC-Com-B  (192.168.20.21)
â”œâ”€ Fa0/3 : PC-Info-A (192.168.30.11)    â””â”€ Fa0/3 : PC-Info-B (192.168.30.21)
â””â”€ Fa0/24: â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€ Trunk â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€ Fa0/24

Passerelle VLAN 10 : 192.168.10.1 (non simulÃ©e)
Passerelle VLAN 20 : 192.168.20.1 (non simulÃ©e)
Passerelle VLAN 30 : 192.168.30.1 (non simulÃ©e)
```

---

### Ã‰tape 1 : CrÃ©er la Topologie (8 min)

1. Ouvrir Packet Tracer â†’ Nouveau fichier
2. Ajouter **2 switchs Cisco 2960** + **6 PC**
3. **CÃ¢bler :**
   - PC-Dir-A â†’ SW-A Fa0/1 (cÃ¢ble droit)
   - PC-Com-A â†’ SW-A Fa0/2
   - PC-Info-A â†’ SW-A Fa0/3
   - PC-Dir-B â†’ SW-B Fa0/1
   - PC-Com-B â†’ SW-B Fa0/2
   - PC-Info-B â†’ SW-B Fa0/3
   - SW-A Fa0/24 â†’ SW-B Fa0/24 (cÃ¢ble droit)

4. **Configurer les IP des PC :**

| **PC** | **IP** | **Masque** | **Passerelle** |
|--------|--------|------------|----------------|
| PC-Dir-A | 192.168.10.11 | 255.255.255.0 | 192.168.10.1 |
| PC-Com-A | 192.168.20.11 | 255.255.255.0 | 192.168.20.1 |
| PC-Info-A | 192.168.30.11 | 255.255.255.0 | 192.168.30.1 |
| PC-Dir-B | 192.168.10.21 | 255.255.255.0 | 192.168.10.1 |
| PC-Com-B | 192.168.20.21 | 255.255.255.0 | 192.168.20.1 |
| PC-Info-B | 192.168.30.21 | 255.255.255.0 | 192.168.30.1 |

---

### Ã‰tape 2 : Test "Avant VLANs" (5 min)

Sur **PC-Dir-A** â†’ Desktop â†’ Command Prompt :
```
ping 192.168.20.11   (vers PC-Com-A, mÃªme switch)
ping 192.168.10.21   (vers PC-Dir-B, autre switch)
```

ðŸ“ **RÃ©sultats Ã  noter :** Les pings fonctionnent-ils ? (Oui, pour les mÃªmes sous-rÃ©seaux si adresses cohÃ©rentes)

âš ï¸ Attention : PC-Dir-A (192.168.10.11) ne peut pas pinger PC-Com-A (192.168.20.11) car IPs dans rÃ©seaux diffÃ©rents, **mÃªme sans VLAN**. Les VLANs ajoutent l'isolation L2, en plus de l'isolation L3.

---

### Ã‰tape 3 : Configurer SW-A â€” VLANs et Ports Access (15 min)

```cisco
! AccÃ©der au switch SW-A
SW-A> enable
SW-A# configure terminal

! Renommer le switch
SW-A(config)# hostname SW-A

! DÃ©sactiver rÃ©solution DNS
SW-A(config)# no ip domain-lookup

! CrÃ©er les 3 VLANs
SW-A(config)# vlan 10
SW-A(config-vlan)# name DIRECTION
SW-A(config-vlan)# exit

SW-A(config)# vlan 20
SW-A(config-vlan)# name COMMERCIAL
SW-A(config-vlan)# exit

SW-A(config)# vlan 30
SW-A(config-vlan)# name INFORMATIQUE
SW-A(config-vlan)# exit

! Affecter Fa0/1 â†’ VLAN 10
SW-A(config)# interface FastEthernet0/1
SW-A(config-if)# switchport mode access
SW-A(config-if)# switchport access vlan 10
SW-A(config-if)# exit

! Affecter Fa0/2 â†’ VLAN 20
SW-A(config)# interface FastEthernet0/2
SW-A(config-if)# switchport mode access
SW-A(config-if)# switchport access vlan 20
SW-A(config-if)# exit

! Affecter Fa0/3 â†’ VLAN 30
SW-A(config)# interface FastEthernet0/3
SW-A(config-if)# switchport mode access
SW-A(config-if)# switchport access vlan 30
SW-A(config-if)# exit

! VÃ©rifier
SW-A(config)# end
SW-A# show vlan brief
```

âœ… **Validation :** Fa0/1 dans VLAN 10, Fa0/2 dans VLAN 20, Fa0/3 dans VLAN 30.

---

### Ã‰tape 4 : Configurer le Trunk sur SW-A (8 min)

```cisco
SW-A# configure terminal

SW-A(config)# interface FastEthernet0/24
SW-A(config-if)# switchport mode trunk
SW-A(config-if)# switchport trunk allowed vlan 10,20,30
SW-A(config-if)# exit

SW-A(config)# end
SW-A# show interfaces trunk
```

âœ… **Validation :** Fa0/24 en mode trunking, VLANs 10,20,30 autorisÃ©s.

---

### Ã‰tape 5 : Configurer SW-B (15 min)

**MÃªme configuration sur SW-B** (VLANs identiques, ports identiques, trunk sur Fa0/24).

```cisco
SW-B> enable
SW-B# configure terminal
SW-B(config)# hostname SW-B
SW-B(config)# no ip domain-lookup

SW-B(config)# vlan 10
SW-B(config-vlan)# name DIRECTION
SW-B(config-vlan)# exit
SW-B(config)# vlan 20
SW-B(config-vlan)# name COMMERCIAL
SW-B(config-vlan)# exit
SW-B(config)# vlan 30
SW-B(config-vlan)# name INFORMATIQUE
SW-B(config-vlan)# exit

SW-B(config)# interface FastEthernet0/1
SW-B(config-if)# switchport mode access
SW-B(config-if)# switchport access vlan 10
SW-B(config-if)# exit

SW-B(config)# interface FastEthernet0/2
SW-B(config-if)# switchport mode access
SW-B(config-if)# switchport access vlan 20
SW-B(config-if)# exit

SW-B(config)# interface FastEthernet0/3
SW-B(config-if)# switchport mode access
SW-B(config-if)# switchport access vlan 30
SW-B(config-if)# exit

SW-B(config)# interface FastEthernet0/24
SW-B(config-if)# switchport mode trunk
SW-B(config-if)# switchport trunk allowed vlan 10,20,30
SW-B(config-if)# exit

SW-B(config)# end
SW-B# copy run start
```

---

### Ã‰tape 6 : Sauvegarder SW-A (2 min)

```cisco
SW-A# copy running-config startup-config
```

---

### Ã‰tape 7 : Tests de Validation (10 min)

RÃ©aliser les tests suivants et noter les rÃ©sultats :

| **Test** | **Depuis** | **Vers** | **Ping** | **RÃ©sultat attendu** | **RÃ©sultat rÃ©el** |
|----------|------------|----------|----------|----------------------|-------------------|
| 1 | PC-Dir-A | PC-Dir-B (mÃªme VLAN, autre switch) | `ping 192.168.10.21` | âœ… SuccÃ¨s | |
| 2 | PC-Com-A | PC-Com-B (mÃªme VLAN, autre switch) | `ping 192.168.20.21` | âœ… SuccÃ¨s | |
| 3 | PC-Dir-A | PC-Com-A (VLANs diffÃ©rents, mÃªme switch) | `ping 192.168.20.11` | âŒ Ã‰chec attendu | |
| 4 | PC-Dir-A | PC-Info-B (VLANs diffÃ©rents, autre switch) | `ping 192.168.30.21` | âŒ Ã‰chec attendu | |

ðŸ“ **Analyse :**
- Tests 1 et 2 : mÃªme VLAN â†’ communication possible mÃªme sur 2 switches diffÃ©rents (grÃ¢ce au trunk)
- Tests 3 et 4 : VLANs diffÃ©rents â†’ isolation garantie (mÃªme sans routeur)

---

### Ã‰tape 8 : VÃ©rifications Finales (5 min)

```cisco
! Sur SW-A :
SW-A# show vlan brief
SW-A# show interfaces trunk
SW-A# show interfaces FastEthernet0/1 switchport
SW-A# show mac address-table vlan 10
```

ðŸ“ **Questions :**
1. Combien d'entrÃ©es dans la table MAC pour VLAN 10 aprÃ¨s les tests ?
2. Le port Fa0/24 apparaÃ®t-il dans `show vlan brief` ? Pourquoi ?
3. La colonne "Native VLAN" dans `show interfaces trunk` indique quoi ?

---

### Ã‰tape 9 : Sauvegarde Packet Tracer

`File â†’ Save As â†’ NOM_Prenom_S7_TP_VLAN_Trunk.pkt`

---

## ðŸ§ TP LINUX
### "Utilisateurs, Groupes et Permissions"

---

### Objectif

CrÃ©er une organisation utilisateurs/groupes sur Debian (3 services, 6 utilisateurs), configurer des rÃ©pertoires partagÃ©s avec les bonnes permissions.

---

### ScÃ©nario

> Le cabinet **TechPro SARL** (client S6) demande de prÃ©parer son serveur Linux pour 3 services :
> - **Direction** (2 utilisateurs) : rÃ©pertoire `/data/direction`
> - **Commercial** (2 utilisateurs) : rÃ©pertoire `/data/commercial`
> - **Informatique** (2 utilisateurs) : rÃ©pertoire `/data/informatique`
>
> Chaque service ne doit accÃ©der qu'Ã  son propre rÃ©pertoire. L'Informatique doit pouvoir accÃ©der Ã  tous les rÃ©pertoires (pour les sauvegardes).

---

### Ã‰tape 1 : CrÃ©er les Groupes

```bash
sudo groupadd direction
sudo groupadd commercial
sudo groupadd informatique

# VÃ©rifier
cat /etc/group | grep -E "direction|commercial|informatique"
```

---

### Ã‰tape 2 : CrÃ©er les Utilisateurs

```bash
# Direction
sudo useradd -m -s /bin/bash -G direction alice
sudo passwd alice    # MDP : Alice@123

sudo useradd -m -s /bin/bash -G direction bob
sudo passwd bob      # MDP : Bob@123

# Commercial
sudo useradd -m -s /bin/bash -G commercial charlie
sudo passwd charlie  # MDP : Charlie@123

sudo useradd -m -s /bin/bash -G commercial diana
sudo passwd diana    # MDP : Diana@123

# Informatique
sudo useradd -m -s /bin/bash -G informatique eric
sudo passwd eric     # MDP : Eric@123

sudo useradd -m -s /bin/bash -G informatique fiona
sudo passwd fiona    # MDP : Fiona@123
```

**VÃ©rifier :**
```bash
id alice       # uid=...(alice) gid=...(alice) groups=...(alice),...(direction)
cat /etc/passwd | tail -6    # Les 6 derniers utilisateurs crÃ©Ã©s
```

---

### Ã‰tape 3 : CrÃ©er les RÃ©pertoires et DÃ©finir les Permissions

```bash
# CrÃ©er les rÃ©pertoires
sudo mkdir -p /data/direction /data/commercial /data/informatique

# Affecter les groupes
sudo chown root:direction /data/direction
sudo chown root:commercial /data/commercial
sudo chown root:informatique /data/informatique

# Permissions : groupe peut tout (rwx), autres rien
sudo chmod 770 /data/direction
sudo chmod 770 /data/commercial
sudo chmod 770 /data/informatique

# VÃ©rifier
ls -ld /data/direction /data/commercial /data/informatique
```

**RÃ©sultat attendu :**
```
drwxrwx--- 2 root direction    4096 nov 15 /data/direction
drwxrwx--- 2 root commercial   4096 nov 15 /data/commercial
drwxrwx--- 2 root informatique 4096 nov 15 /data/informatique
```

---

### Ã‰tape 4 : Donner AccÃ¨s Multi-RÃ©pertoires Ã  l'Informatique

```bash
# Eric et Fiona (Informatique) doivent accÃ©der Ã  TOUS les rÃ©pertoires
sudo usermod -aG direction eric
sudo usermod -aG commercial eric
sudo usermod -aG direction fiona
sudo usermod -aG commercial fiona

# VÃ©rifier
groups eric    # eric informatique direction commercial
```

---

### Ã‰tape 5 : Tester les AccÃ¨s

```bash
# Test 1 : alice (direction) accÃ¨de Ã  son rÃ©pertoire
su - alice
ls /data/direction    # âœ… Doit fonctionner
ls /data/commercial   # âŒ Doit afficher "Permission non accordÃ©e"
exit

# Test 2 : charlie (commercial) accÃ¨de Ã  son rÃ©pertoire
su - charlie
echo "Fichier commercial" > /data/commercial/test.txt   # âœ… Doit crÃ©er le fichier
ls /data/direction                                       # âŒ Permission refusÃ©e
exit

# Test 3 : eric (informatique) accÃ¨de Ã  tous
su - eric
ls /data/direction    # âœ… Doit fonctionner
ls /data/commercial   # âœ… Doit fonctionner
exit
```

---

### Ã‰tape 6 : Exercices de Permissions

```bash
# 1. CrÃ©er un fichier confidentiel accessible uniquement au propriÃ©taire
touch /home/alice/confidentiel.txt
chmod 600 /home/alice/confidentiel.txt
ls -l /home/alice/confidentiel.txt
# â†’ -rw------- alice alice ...

# 2. CrÃ©er un script exÃ©cutable par tous
touch /usr/local/bin/ping_test.sh
echo '#!/bin/bash' > /usr/local/bin/ping_test.sh
echo 'ping -c 1 8.8.8.8' >> /usr/local/bin/ping_test.sh
chmod 755 /usr/local/bin/ping_test.sh
ls -l /usr/local/bin/ping_test.sh
# â†’ -rwxr-xr-x root root ...

# 3. RÃ©pertoire lisible par le groupe, interdit aux autres
mkdir /data/rapports
chown root:direction /data/rapports
chmod 750 /data/rapports
ls -ld /data/rapports
# â†’ drwxr-x--- root direction ...
```

---
